Revit 2026 API
ExternalResourceReference Constructor
Overload List
Name | Description
ExternalResourceReference(ExternalResourceReference) |  Creates a new ExternalResourceReference from the given ExternalResourceReference.
ExternalResourceReference(Guid, IDictionary<String, String>, String, String) | Initializes a new instance of the ExternalResourceReference class
Top
See Also
Reference
ExternalResourceReference Class
Autodesk.Revit.DB Namespace